setup.typeCompatibility = {
    "노말": {
        "약함": ["바위", "강철"],
        "매우 약함": [["바위", "강철"]],
        "무효": ["고스트"],
    },
    "불꽃": {
        "강함": ["풀", "벌레", "얼음", "강철"],
        "약함": ["물", "바위", "불꽃", "드래곤"],
        "매우강함": [["풀", "벌레"], ["풀", "얼음"], ["풀", "강철"], ["벌레", "얼음"], ["벌레", "강철"], ["얼음", "강철"]],
        "매우약함": [["물", "바위"], ["물", "불꽃"], ["물", "드래곤"], ["불꽃", "바위"], ["드래곤", "바위"], ["불꽃", "드래곤"]]
    },
    "물": {
        "강함": ["불꽃", "땅", "바위"],
        "약함": ["물", "풀", "드래곤"],
        "매우강함": [["불꽃", "땅"], ["불꽃", "바위"], ["땅", "바위"]],
        "매우약함": [["물", "풀"], ["물", "드래곤"], ["풀", "드래곤"]]
    },
    "풀": {
        "강함": ["물", "땅", "바위"],
        "약함": ["불꽃", "풀", "독", "비행", "벌레", "드래곤", "강철"],
        "매우강함": [["물", "땅"], ["물", "바위"], ["땅", "바위"]],
        "매우약함": [["불꽃", "풀"], ["불꽃", "독"], ["불꽃", "비행"],["불꽃", "벌레"],
                    ["불꽃", "드래곤"], ["불꽃", "강철"], ["풀", "독"], ["풀", "비행"],
                    ["풀", "벌레"], ["풀", "드래곤"], ["풀", "강철"], ["독", "비행"],
                    ["독", "벌레"], ["독", "드래곤"], ["독", "강철"], ["비행", "벌레"],
                    ["비행", "드래곤"], ["비행", "강철"], ["벌레", "드래곤"], ["벌레", "강철"], ["강철", "드래곤"]]
    },
    "전기": {
        "강함": ["물", "비행"],
        "약함": ["풀", "전기", "드래곤"],
        "매우강함": [["물", "비행"]],
        "매우약함": [["풀", "전기"], ["풀", "드래곤"], ["전기", "드래곤"]],
        "무효": ["땅"]
    },
    "얼음": {
        "강함": ["풀", "땅", "비행", "드래곤"],
        "약함": ["불꽃", "물", "얼음", "강철"],
        "매우강함": [["풀", "땅"], ["풀", "비행"], ["풀", "드래곤"], ["땅", "비행"],
                    ["땅", "드래곤"], ["비행", "드래곤"]],
        "매우약함": [["불꽃", "물"], ["불꽃", "얼음"], ["불꽃", "강철"], ["물", "얼음"],
                    ["물", "강철"], ["강철", "얼음"]],
    },
    "격투": {
        "강함": ["노말", "얼음", "바위", "악", "강철"],
        "약함": ["독", "비행", "에스퍼", "벌레", "페어리"],
        "매우강함": [["노말", "얼음"], ["노말", "바위"], ["노말", "악"], ["노말", "강철"],
                    ["얼음", "바위"], ["얼음", "악"], ["얼음", "강철"], ["바위", "악"],
                    ["바위", "강철"], ["강철", "악"]],
        "매우약함": [["독", "비행"], ["독", "에스퍼"], ["독", "벌레"], ["독", "페어리"],
                    ["비행", "에스퍼"], ["비행", "벌레"] ["비행", "페어리"], ["에스퍼", "벌레"],
                    ["에스퍼", "페어리"], ["페어리", "벌레"]],
        "무효": ["고스트"]
    },
    "독": {
        "강함": ["풀", "페어리"],
        "약함": ["독", "땅", "바위", "고스트"],
        "매우강함": [["풀", "페어리"]],
        "매우약함": [["독", "땅"], ["독", "바위"], ["독", "고스트"], ["땅", "바위"],
                    ["땅", "고스트"], ["바위", "고스트"]],
        "무효": ["강철"]
    },
    "땅": {
        "강함": ["불꽃", "전기", "독", "바위", "강철"],
        "약함": ["풀", "벌레"],
        "매우강함": [["불꽃", "전기"], ["불꽃", "독"], ["불꽃", "바위"], ["불꽃", "강철"]
                    ["전기", "독"], ["전기", "바위"], ["전기", "강철"], ["독", "바위"]
                    ["독", "강철"], ["바위", "강철"]],
        "매우약함": [["풀", "벌레"]],
        "무효": ["비행"]
    },
    "비행": {
        "강함": ["풀", "격투", "벌레"],
        "약함": ["전기", "바위", "강철"],
        "매우강함": [["풀", "격투"], ["풀", "벌레"], ["격투", "벌레"]],
        "매우약함": [["전기", "바위"], ["전기", "강철"], ["바위", "강철"]],
    },
    "에스퍼": {
        "강함": ["격투", "독"],
        "약함": ["에스퍼", "강철"],
        "매우강함": [["격투", "독"]],
        "매우약함": [["에스퍼", "강철"]],
        "무효": ["악"]
    },
    "벌레": {
        "강함": ["풀", "에스퍼", "악"],
        "약함": ["불꽃", "격투", "독", "비행", "고스트", "강철", "페어리"],
        "매우강함": [["풀", "에스퍼"], ["풀", "악"], ["에스퍼", "악"]],
        "매우약함": [["불꽃", "격투"], ["불꽃", "독"], ["불꽃", "비행"], ["불꽃", "고스트"],
                    ["불꽃", "강철"], ["불꽃", "페어리"], ["격투", "독"], ["격투", "비행"],
                    ["격투", "고스트"], ["격투", "강철"], ["격투", "페어리"], ["독", "비행"],
                    ["독", "고스트"], ["독", "강철"], ["독", "페어리"], ["비행", "고스트"],
                    ["비행", "강철"], ["비행", "페어리"], ["고스트", "강철"], ["고스트", "페어리"],
                    ["페어리", "강철"]]
    },
    "바위": {
        "강함": ["불꽃", "얼음", "비행", "벌레",],
        "약함": ["격투", "땅", "강철"],
        "매우강함": [["불꽃", "얼음"], ["불꽃", "비행"], ["불꽃", "벌레"], ["얼음", "비행"],
                    ["얼음", "벌레"], ["비행", "벌레"]],
        "매우약함": [["격투", "땅"], ["격투", "강철"], ["땅", "강철"]]
    },
    "고스트": {
        "강함": ["에스퍼", "고스트"],
        "약함": ["악"],
        "매우강함": [["에스퍼", "고스트"]],
        "무효": ["노말"]
    },
    "드래곤": {
        "강함": ["드래곤"],
        "약함": ["강철"],
        "무효": ["페어리"]
    },
    "악": {
        "강함": ["에스퍼", "고스트"],
        "약함": ["격투", "악", "페어리"],
        "매우강함": [["에스퍼", "고스트"]],
        "매우약함": [["격투", "악"], ["격투", "페어리"], ["악", "페어리"]]
    },
    "강철": {
        "강함": ["얼음", "바위", "페어리"],
        "약함": ["불꽃", "물", "전기", "강철"],
        "매우강함": [["얼음", "바위"], ["얼음", "페어리"], ["바위", "페어리"]],
        "매우약함": [["불꽃", "물"], ["불꽃", "전기"], ["불꽃", "강철"], ["물", "전기"],
                    ["물", "강철"], ["전기", "강철"]]
    },
    "페어리": {
        "강함": ["격투", "드래곤", "악"],
        "약함": ["불꽃", "독", "강철"],
        "매우강함": [["격투", "드래곤"], ["격투", "악"], ["드래곤", "악"]],
        "매우약함": [["불꽃", "독"], ["불꽃", "강철"], ["독", "강철"],]
    },
};